zephyrproject-rtos/hal_nxp/dts/nxp/s32/pinctrl/S32K311_K310_48LQFP-pinctrl.h
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on S32K311_K310_100HDQFP-pinctrl.h with this part's differences applied
 * below (362 removed, 0 changed,
 * 0 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 4857b10565a5e56f
 */

#ifndef _ZEPHYR_DTS_BINDING_S32K311_K310_48LQFP_WRAPPER_
#define _ZEPHYR_DTS_BINDING_S32K311_K310_48LQFP_WRAPPER_

#include "S32K311_K310_100HDQFP-pinctrl.h"

/* Signals not present on this part */
#undef PTA14_EIRQ22
#undef PTA14_EMIOS_1_CH4_H_I
#undef PTA14_EMIOS_1_CH4_H_O
#undef PTA14_FXIO_D14_I
#undef PTA14_FXIO_D14_O
#undef PTA14_LPSPI1_PCS3_I
#undef PTA14_LPSPI1_PCS3_O
#undef PTA15_EIRQ23
#undef PTA15_EMIOS_0_CH10_H_I
#undef PTA15_EMIOS_0_CH10_H_O
#undef PTA15_LPSPI0_PCS3_I
#undef PTA15_LPSPI0_PCS3_O
#undef PTA15_LPSPI2_PCS3_I
#undef PTA15_LPSPI2_PCS3_O
#undef PTA15_LPUART1_DTR_B
#undef PTA16_EIRQ4
#undef PTA16_EMIOS_0_CH11_H_I
#undef PTA16_EMIOS_0_CH11_H_O
#undef PTA16_LPSPI0_PCS4_I
#undef PTA16_LPSPI0_PCS4_O
#undef PTA16_LPSPI1_PCS2_I
#undef PTA16_LPSPI1_PCS2_O
#undef PTA16_LPUART1_DSR_B
#undef PTA6_CAN0_RX
#undef PTA6_EIRQ6
#undef PTA6_EMIOS_1_CH13_H_I
#undef PTA6_EMIOS_1_CH13_H_O
#undef PTA6_LPSPI1_PCS1_I
#undef PTA6_LPSPI1_PCS1_O
#undef PTA6_LPSPI3_PCS1_I
#undef PTA6_LPSPI3_PCS1_O
#undef PTA6_LPUART0_RIN_B
#undef PTA6_LPUART1_CTS
#undef PTA6_LPUART3_RX
#undef PTA8_EIRQ16
#undef PTA8_EMIOS_1_CH12_H_I
#undef PTA8_EMIOS_1_CH12_H_O
#undef PTA8_FXIO_D6_I
#undef PTA8_FXIO_D6_O
#undef PTA8_LPSPI2_SOUT_I
#undef PTA8_LPSPI2_SOUT_O
#undef PTA8_LPUART2_RX
#undef PTA9_EIRQ17
#undef PTA9_FXIO_D7_I
#undef PTA9_FXIO_D7_O
#undef PTA9_LPSPI2_PCS0_I
#undef PTA9_LPSPI2_PCS0_O
#undef PTA9_LPSPI3_PCS0_I
#undef PTA9_LPSPI3_PCS0_O
#undef PTA9_LPUART2_TX_I
#undef PTA9_LPUART2_TX_O
#undef PTB10_EIRQ24
#undef PTB10_EMIOS_1_CH17_Y_I
#undef PTB10_EMIOS_1_CH17_Y_O
#undef PTB10_LCU0_OUT9
#undef PTB10_LPUART0_DTR_B
#undef PTB11_EIRQ25
#undef PTB11_EMIOS_1_CH18_Y_I
#undef PTB11_EMIOS_1_CH18_Y_O
#undef PTB11_LCU0_OUT8
#undef PTB11_LPI2C0_HREQ
#undef PTB11_LPUART0_DSR_B
#undef PTB12_EIRQ26
#undef PTB12_EMIOS_0_CH0_X_I
#undef PTB12_EMIOS_0_CH0_X_O
#undef PTB12_LCU0_OUT2
#undef PTB12_LPSPI3_PCS3_I
#undef PTB12_LPSPI3_PCS3_O
#undef PTB12_LPUART0_DCD_B
#undef PTB14_EIRQ28
#undef PTB14_EMIOS_0_CH2_G_I
#undef PTB14_EMIOS_0_CH2_G_O
#undef PTB14_LCU0_OUT7
#undef PTB14_LPSPI1_SCK_I
#undef PTB14_LPSPI1_SCK_O
#undef PTB15_EIRQ29
#undef PTB15_EMIOS_0_CH3_G_I
#undef PTB15_EMIOS_0_CH3_G_O
#undef PTB15_LPSPI1_SIN_I
#undef PTB15_LPSPI1_SIN_O
#undef PTB16_EIRQ30
#undef PTB16_EMIOS_0_CH4_G_I
#undef PTB16_EMIOS_0_CH4_G_O
#undef PTB16_LPSPI1_SOUT_I
#undef PTB16_LPSPI1_SOUT_O
#undef PTB17_EIRQ31
#undef PTB17_EMIOS_0_CH5_G_I
#undef PTB17_EMIOS_0_CH5_G_O
#undef PTB17_EMIOS_1_CH7_H_I
#undef PTB17_EMIOS_1_CH7_H_O
#undef PTB17_LPSPI1_PCS3_I
#undef PTB17_LPSPI1_PCS3_O
#undef PTB17_LPSPI3_PCS0_I
#undef PTB17_LPSPI3_PCS0_O
#undef PTB8_EIRQ14
#undef PTB8_EMIOS_1_CH15_H_I
#undef PTB8_EMIOS_1_CH15_H_O
#undef PTB8_LCU0_OUT11
#undef PTB8_LPSPI0_PCS5_I
#undef PTB8_LPSPI0_PCS5_O
#undef PTB8_LPUART1_DCD_B
#undef PTB9_EIRQ15
#undef PTB9_EMIOS_1_CH16_X_I
#undef PTB9_EMIOS_1_CH16_X_O
#undef PTB9_LCU0_OUT10
#undef PTB9_LPUART1_RIN_B
#undef PTC0_EIRQ0
#undef PTC0_EMIOS_0_CH0_X_I
#undef PTC0_EMIOS_0_CH0_X_O
#undef PTC0_EMIOS_0_CH14_H_I
#undef PTC0_EMIOS_0_CH14_H_O
#undef PTC10_EIRQ18
#undef PTC10_EMIOS_0_CH6_G_I
#undef PTC10_EMIOS_0_CH6_G_O
#undef PTC10_EMIOS_1_CH0_X_I
#undef PTC10_EMIOS_1_CH0_X_O
#undef PTC10_LCU0_OUT1
#undef PTC10_LCU1_OUT11
#undef PTC10_LPSPI2_PCS1_I
#undef PTC10_LPSPI2_PCS1_O
#undef PTC10_LPUART0_DSR_B
#undef PTC10_TRGMUX_IN11
#undef PTC11_EIRQ19
#undef PTC11_EMIOS_1_CH1_H_I
#undef PTC11_EMIOS_1_CH1_H_O
#undef PTC11_FXIO_D15_I
#undef PTC11_FXIO_D15_O
#undef PTC11_LCU0_OUT0
#undef PTC11_LCU1_OUT10
#undef PTC11_LPUART0_DTR_B
#undef PTC11_TRGMUX_IN10
#undef PTC12_ADC1_MA2
#undef PTC12_EIRQ20
#undef PTC12_EMIOS_0_CH22_X_I
#undef PTC12_EMIOS_0_CH22_X_O
#undef PTC12_EMIOS_1_CH2_H_I
#undef PTC12_EMIOS_1_CH2_H_O
#undef PTC12_LCU1_OUT9
#undef PTC12_LPSPI2_PCS1_I
#undef PTC12_LPSPI2_PCS1_O
#undef PTC13_ADC1_MA1
#undef PTC13_EIRQ21
#undef PTC13_EMIOS_0_CH23_X_I
#undef PTC13_EMIOS_0_CH23_X_O
#undef PTC13_EMIOS_1_CH3_H_I
#undef PTC13_EMIOS_1_CH3_H_O
#undef PTC13_LCU1_OUT8
#undef PTC17_CAN2_TX
#undef PTC17_FXIO_D14_I
#undef PTC17_FXIO_D14_O
#undef PTC17_FXIO_D2_I
#undef PTC17_FXIO_D2_O
#undef PTC17_LPI2C1_SCLS_I
#undef PTC17_LPI2C1_SCLS_O
#undef PTC17_LPSPI3_SCK_I
#undef PTC17_LPSPI3_SCK_O
#undef PTD10_CLKOUT_RUN
#undef PTD10_EIRQ26
#undef PTD10_EMIOS_0_CH16_X_I
#undef PTD10_EMIOS_0_CH16_X_O
#undef PTD10_EMIOS_1_CH10_H_I
#undef PTD10_EMIOS_1_CH10_H_O
#undef PTD10_LPSPI0_SIN_I
#undef PTD10_LPSPI0_SIN_O
#undef PTD11_EIRQ27
#undef PTD11_EMIOS_0_CH17_Y_I
#undef PTD11_EMIOS_0_CH17_Y_O
#undef PTD11_LPSPI0_SCK_I
#undef PTD11_LPSPI0_SCK_O
#undef PTD11_LPUART2_CTS
#undef PTD12_EIRQ28
#undef PTD12_EMIOS_0_CH18_Y_I
#undef PTD12_EMIOS_0_CH18_Y_O
#undef PTD12_LPI2C1_HREQ
#undef PTD12_LPSPI0_SOUT_I
#undef PTD12_LPSPI0_SOUT_O
#undef PTD12_LPUART2_RTS
#undef PTD13_EIRQ29
#undef PTD13_EMIOS_0_CH20_Y_I
#undef PTD13_EMIOS_0_CH20_Y_O
#undef PTD13_FXIO_D7_I
#undef PTD13_FXIO_D7_O
#undef PTD13_LPI2C0_SDA_I
#undef PTD13_LPI2C0_SDA_O
#undef PTD13_LPUART1_RX
#undef PTD14_CLKOUT_RUN
#undef PTD14_CMP0_RR_ACTIVE
#undef PTD14_EIRQ30
#undef PTD14_EMIOS_0_CH21_Y_I
#undef PTD14_EMIOS_0_CH21_Y_O
#undef PTD14_LPI2C0_SCL_I
#undef PTD14_LPI2C0_SCL_O
#undef PTD14_LPUART1_TX_I
#undef PTD14_LPUART1_TX_O
#undef PTD16_EMIOS_0_CH1_G_I
#undef PTD16_EMIOS_0_CH1_G_O
#undef PTD16_EMIOS_1_CH15_H_I
#undef PTD16_EMIOS_1_CH15_H_O
#undef PTD16_LPSPI0_SIN_I
#undef PTD16_LPSPI0_SIN_O
#undef PTD16_LPUART2_RTS
#undef PTD17_EIRQ24
#undef PTD17_EMIOS_0_CH18_Y_I
#undef PTD17_EMIOS_0_CH18_Y_O
#undef PTD17_FXIO_D9_I
#undef PTD17_FXIO_D9_O
#undef PTD17_LPSPI3_PCS0_I
#undef PTD17_LPSPI3_PCS0_O
#undef PTD17_LPUART2_RX
#undef PTD4_EIRQ12
#undef PTD4_EMIOS_1_CH23_X_I
#undef PTD4_EMIOS_1_CH23_X_O
#undef PTD4_LCU0_OUT6
#undef PTD4_LPSPI1_PCS1_I
#undef PTD4_LPSPI1_PCS1_O
#undef PTD6_EIRQ14
#undef PTD6_EMIOS_1_CH12_H_I
#undef PTD6_EMIOS_1_CH12_H_O
#undef PTD6_FXIO_D13_I
#undef PTD6_FXIO_D13_O
#undef PTD6_FXIO_D3_I
#undef PTD6_FXIO_D3_O
#undef PTD6_LPSPI0_PCS0_I
#undef PTD6_LPSPI0_PCS0_O
#undef PTD6_LPUART2_RX
#undef PTD7_EIRQ15
#undef PTD7_LPSPI0_PCS3_I
#undef PTD7_LPSPI0_PCS3_O
#undef PTD7_LPSPI3_PCS3_I
#undef PTD7_LPSPI3_PCS3_O
#undef PTD7_LPUART2_TX_I
#undef PTD7_LPUART2_TX_O
#undef PTD8_EIRQ24
#undef PTD8_EMIOS_0_CH12_H_I
#undef PTD8_EMIOS_0_CH12_H_O
#undef PTD8_FXIO_D11_I
#undef PTD8_FXIO_D11_O
#undef PTD8_FXIO_D1_I
#undef PTD8_FXIO_D1_O
#undef PTD8_LPI2C1_SDA_I
#undef PTD8_LPI2C1_SDA_O
#undef PTD8_LPSPI3_SOUT_I
#undef PTD8_LPSPI3_SOUT_O
#undef PTD9_EIRQ25
#undef PTD9_EMIOS_0_CH13_H_I
#undef PTD9_EMIOS_0_CH13_H_O
#undef PTD9_FXIO_D0_I
#undef PTD9_FXIO_D0_O
#undef PTD9_FXIO_D10_I
#undef PTD9_FXIO_D10_O
#undef PTD9_LPI2C1_SCL_I
#undef PTD9_LPI2C1_SCL_O
#undef PTE0_EIRQ0
#undef PTE0_FXIO_D3_I
#undef PTE0_FXIO_D3_O
#undef PTE0_LPSPI0_SIN_I
#undef PTE0_LPSPI0_SIN_O
#undef PTE10_CLKOUT_STANDBY
#undef PTE10_EIRQ9
#undef PTE10_EMIOS_0_CH20_Y_I
#undef PTE10_EMIOS_0_CH20_Y_O
#undef PTE10_FXIO_D4_I
#undef PTE10_FXIO_D4_O
#undef PTE10_LPSPI2_PCS1_I
#undef PTE10_LPSPI2_PCS1_O
#undef PTE10_LPSPI3_SIN_I
#undef PTE10_LPSPI3_SIN_O
#undef PTE10_TRGMUX_OUT4
#undef PTE11_EIRQ10
#undef PTE11_EMIOS_0_CH1_G_I
#undef PTE11_EMIOS_0_CH1_G_O
#undef PTE11_EMIOS_0_CH21_Y_I
#undef PTE11_EMIOS_0_CH21_Y_O
#undef PTE11_FXIO_D5_I
#undef PTE11_FXIO_D5_O
#undef PTE11_LPSPI2_PCS0_I
#undef PTE11_LPSPI2_PCS0_O
#undef PTE11_TRGMUX_IN8
#undef PTE11_TRGMUX_OUT5
#undef PTE12_CMP0_RR_ACTIVE
#undef PTE12_EIRQ11
#undef PTE12_EMIOS_1_CH5_H_I
#undef PTE12_EMIOS_1_CH5_H_O
#undef PTE12_FXIO_D7_I
#undef PTE12_FXIO_D7_O
#undef PTE12_FXIO_D8_I
#undef PTE12_FXIO_D8_O
#undef PTE12_LPUART2_TX_I
#undef PTE12_LPUART2_TX_O
#undef PTE13_EIRQ12
#undef PTE13_EMIOS_1_CH5_H_I
#undef PTE13_EMIOS_1_CH5_H_O
#undef PTE13_FXIO_D5_I
#undef PTE13_FXIO_D5_O
#undef PTE13_LPSPI2_PCS0_I
#undef PTE13_LPSPI2_PCS0_O
#undef PTE13_LPSPI2_PCS2_I
#undef PTE13_LPSPI2_PCS2_O
#undef PTE15_EIRQ14
#undef PTE15_EMIOS_0_CH22_X_I
#undef PTE15_EMIOS_0_CH22_X_O
#undef PTE15_FCCU_ERR0
#undef PTE15_FCCU_ERR_IN0
#undef PTE15_FXIO_D2_I
#undef PTE15_FXIO_D2_O
#undef PTE15_LPSPI2_SCK_I
#undef PTE15_LPSPI2_SCK_O
#undef PTE15_LPUART1_CTS
#undef PTE15_LPUART3_RX
#undef PTE15_TRGMUX_OUT6
#undef PTE16_EIRQ15
#undef PTE16_EMIOS_0_CH23_X_I
#undef PTE16_EMIOS_0_CH23_X_O
#undef PTE16_FCCU_ERR1
#undef PTE16_FCCU_ERR_IN1
#undef PTE16_FXIO_D3_I
#undef PTE16_FXIO_D3_O
#undef PTE16_LPSPI2_SIN_I
#undef PTE16_LPSPI2_SIN_O
#undef PTE16_LPUART1_RTS
#undef PTE16_LPUART3_TX_I
#undef PTE16_LPUART3_TX_O
#undef PTE16_TRGMUX_OUT7
#undef PTE1_EIRQ1
#undef PTE1_FXIO_D2_I
#undef PTE1_FXIO_D2_O
#undef PTE1_LPSPI0_SCK_I
#undef PTE1_LPSPI0_SCK_O
#undef PTE2_ADC0_MA0
#undef PTE2_EIRQ2
#undef PTE2_EMIOS_0_CH3_G_I
#undef PTE2_EMIOS_0_CH3_G_O
#undef PTE2_EMIOS_1_CH8_X_I
#undef PTE2_EMIOS_1_CH8_X_O
#undef PTE2_FXIO_D13_I
#undef PTE2_FXIO_D13_O
#undef PTE2_LPSPI0_SOUT_I
#undef PTE2_LPSPI0_SOUT_O
#undef PTE2_LPUART1_CTS
#undef PTE3_CMP0_OUT
#undef PTE3_EIRQ3
#undef PTE3_EMIOS_0_CH19_Y_I
#undef PTE3_EMIOS_0_CH19_Y_O
#undef PTE3_FXIO_D6_I
#undef PTE3_FXIO_D6_O
#undef PTE3_LPUART2_RTS
#undef PTE3_TRGMUX_IN6
#undef PTE6_ADC0_MA1
#undef PTE6_EIRQ6
#undef PTE6_EMIOS_1_CH14_H_I
#undef PTE6_EMIOS_1_CH14_H_O
#undef PTE6_FXIO_D12_I
#undef PTE6_FXIO_D12_O
#undef PTE6_LPSPI0_PCS2_I
#undef PTE6_LPSPI0_PCS2_O
#undef PTE6_LPUART1_RTS
#undef PTE7_EMIOS_0_CH7_G_I
#undef PTE7_EMIOS_0_CH7_G_O
#undef PTE7_FXIO_D11_I
#undef PTE7_FXIO_D11_O
#undef PTE7_LPSPI3_SCK_I
#undef PTE7_LPSPI3_SCK_O

#endif /* _ZEPHYR_DTS_BINDING_S32K311_K310_48LQFP_WRAPPER_ */
